In [1]:
import pandas as pd

In [2]:
movies = pd.read_csv('archive/movie.csv')
print(type(movies))
movies.head()

<class 'pandas.core.frame.DataFrame'>

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [3]:
tags = pd.read_csv('archive/tag.csv')
tags.head()

   userId  movieId            tag            timestamp
0      18     4141    Mark Waters  2009-04-24 18:19:40
1      65      208      dark hero  2013-05-10 01:41:18
2      65      353      dark hero  2013-05-10 01:41:19
3      65      521  noir thriller  2013-05-10 01:39:43
4      65      592      dark hero  2013-05-10 01:41:18

In [4]:
ratings = pd.read_csv('archive/rating.csv',parse_dates=['timestamp'])
ratings.head()

   userId  movieId  rating           timestamp
0       1        2     3.5 2005-04-02 23:53:47
1       1       29     3.5 2005-04-02 23:31:16
2       1       32     3.5 2005-04-02 23:33:39
3       1       47     3.5 2005-04-02 23:32:07
4       1       50     3.5 2005-04-02 23:29:40

In [5]:
del ratings['timestamp']
del tags['timestamp']

 ## ðŸ“¦ Data Structures:
 ##
### ðŸš¦ Series

In [6]:
row_0 = tags.iloc[0]
print(row_0)
type(row_0)

userId              18
movieId           4141
tag        Mark Waters
Name: 0, dtype: object

pandas.core.series.Series

In [7]:
row_0.index

Index(['userId', 'movieId', 'tag'], dtype='object')

In [8]:
row_0['userId']

18

In [9]:
'rating' in row_0

False

In [10]:
row_0.name

0

In [11]:
row_0=row_0.rename('firstRow')
row_0

userId              18
movieId           4141
tag        Mark Waters
Name: firstRow, dtype: object

# â–© DataFrames

In [12]:
tags.head()

   userId  movieId            tag
0      18     4141    Mark Waters
1      65      208      dark hero
2      65      353      dark hero
3      65      521  noir thriller
4      65      592      dark hero

In [13]:
tags.index

RangeIndex(start=0, stop=465564, step=1)

In [14]:
tags.columns

Index(['userId', 'movieId', 'tag'], dtype='object')

In [15]:
tags.shape

(465564, 3)

In [16]:
tags.iloc[ [0,11,500] ]

     userId  movieId                tag
0        18     4141        Mark Waters
11       65     1783      noir thriller
500     342    55908  entirely dialogue

# ðŸ“ˆ ðŸ“‰ Descriptive StatisticsÂ¶
Let's look how the ratings are distributed!

In [17]:
ratings['rating'].describe()

count    2.000026e+07
mean     3.525529e+00
std      1.051989e+00
min      5.000000e-01
25%      3.000000e+00
50%      3.500000e+00
75%      4.000000e+00
max      5.000000e+00
Name: rating, dtype: float64

In [18]:
ratings.describe()

             userId       movieId        rating
count  2.000026e+07  2.000026e+07  2.000026e+07
mean   6.904587e+04  9.041567e+03  3.525529e+00
std    4.003863e+04  1.978948e+04  1.051989e+00
min    1.000000e+00  1.000000e+00  5.000000e-01
25%    3.439500e+04  9.020000e+02  3.000000e+00
50%    6.914100e+04  2.167000e+03  3.500000e+00
75%    1.036370e+05  4.770000e+03  4.000000e+00
max    1.384930e+05  1.312620e+05  5.000000e+00

In [19]:
ratings['rating'].mean()

3.5255285642993797

In [20]:
ratings.mean()

userId     69045.872583
movieId     9041.567330
rating         3.525529
dtype: float64

In [21]:
ratings['rating'].min()

0.5

In [22]:
ratings['rating'].max()

5.0

In [23]:
ratings['rating'].mode()

0    4.0
Name: rating, dtype: float64

In [24]:
ratings.corr()

           userId   movieId    rating
userId   1.000000 -0.000850  0.001175
movieId -0.000850  1.000000  0.002606
rating   0.001175  0.002606  1.000000

In [25]:
filter1 = ratings['rating'] > 10
print(filter1)
filter1.any()

0           False
1           False
2           False
3           False
4           False
            ...
20000258    False
20000259    False
20000260    False
20000261    False
20000262    False
Name: rating, Length: 20000263, dtype: bool

False

In [26]:
filter1.all()

False

In [27]:
pd.Series([True, True]).all()
#True

True

In [28]:
 pd.Series([True, False]).all()
#False

False

In [29]:
pd.Series([], dtype="float64").all()
#True

True

In [30]:
import numpy as np
pd.Series([np.nan]).all()
#True

True

In [31]:

pd.Series([np.nan]).all(skipna=False)

True

In [32]:
filter2 = ratings['rating'] > 0
filter2.all()

True

## ðŸ”§ Data Cleaning: Handling Missing DataÂ¶

In [33]:
movies.shape

(27278, 3)

In [34]:
movies

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
27273,131254,Kein Bund fÃ¼r's Leben (2007),Comedy
27274,131256,"Feuer, Eis & Dosenbier (2002)",Comedy
27275,131258,The Pirates (2014),Adventure
27276,131260,Rentun Ruusu (2001),(no genres listed)
27277,131262,Innocence (2014),Adventure|Fantasy|Horror

In [35]:
movies.describe()

             movieId
count   27278.000000
mean    59855.480570
std     44429.314697
min         1.000000
25%      6931.250000
50%     68068.000000
75%    100293.250000
max    131262.000000

In [36]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27278 entries, 0 to 27277
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  27278 non-null  int64
 1   title    27278 non-null  object
 2   genres   27278 non-null  object
dtypes: int64(1), object(2)
memory usage: 639.5+ KB

In [37]:
movies.isnull().any().any()

False

### Thats nice ! No NULL values !

In [38]:
ratings.shape

(20000263, 3)

In [39]:
ratings.isnull().any().any()

False

### Thats nice ! No NULL values !

In [40]:
tags.shape

(465564, 3)

In [41]:
tags.isnull().any().any()

True

### We have some tags which are NULL.

In [42]:
tags=tags.dropna()

In [43]:
tags.isnull().any().any()

False

In [44]:
tags.shape

(465548, 3)

### Thats nice ! No NULL values ! Notice the number of lines have reduced.

## ðŸ“Š Data VisualizationÂ¶

In [45]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000263 entries, 0 to 20000262
Data columns (total 3 columns):
 #   Column   Dtype
---  ------   -----
 0   userId   int64
 1   movieId  int64
 2   rating   float64
dtypes: float64(1), int64(2)
memory usage: 457.8 MB

In [46]:
ratings['rating'].describe()

count    2.000026e+07
mean     3.525529e+00
std      1.051989e+00
min      5.000000e-01
25%      3.000000e+00
50%      3.500000e+00
75%      4.000000e+00
max      5.000000e+00
Name: rating, dtype: float64

In [97]:
%matplotlib inline

ratings.hist(column='rating')

array([[<Axes: title={'center': 'rating'}>]], dtype=object)

In [98]:
ratings.boxplot(column='rating')

## ðŸ“¤ Slicing Out ColumnsÂ¶

In [99]:
tags['tag'].head()

0      Mark Waters
1        dark hero
2        dark hero
3    noir thriller
4        dark hero
Name: tag, dtype: object

In [100]:
movies[['title','genres']].head()

,title,genres
0,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,Jumanji (1995),Adventure|Children|Fantasy
2,Grumpier Old Men (1995),Comedy|Romance
3,Waiting to Exhale (1995),Comedy|Drama|Romance
4,Father of the Bride Part II (1995),Comedy

In [101]:
ratings[-10:]

          userId  movieId  rating
20000253  138493    60816     4.5
20000254  138493    61160     4.0
20000255  138493    65682     4.5
20000256  138493    66762     4.5
20000257  138493    68319     4.5
20000258  138493    68954     4.5
20000259  138493    69526     4.5
20000260  138493    69644     3.0
20000261  138493    70286     5.0
20000262  138493    71619     2.5

In [102]:
tag_counts = tags['tag'].value_counts()
tag_counts[-10:]

tag
missing child                    1
Ron Moore                        1
Citizen Kane                     1
mullet                           1
biker gang                       1
Paul Adelstein                   1
the wig                          1
killer fish                      1
genetically modified monsters    1
topless scene                    1
Name: count, dtype: int64

In [103]:
tag_counts[:10].plot(kind='bar', figsize=(10,5))

## ðŸŽ£ Filters for Selecting RowsÂ¶

In [104]:
is_highly_rated = ratings['rating'] >= 5.0
ratings[is_highly_rated][30:50]

     userId  movieId  rating
239       3       50     5.0
242       3      175     5.0
244       3      223     5.0
245       3      260     5.0
246       3      316     5.0
247       3      318     5.0
248       3      329     5.0
252       3      457     5.0
253       3      480     5.0
254       3      490     5.0
256       3      541     5.0
258       3      593     5.0
263       3      858     5.0
264       3      904     5.0
267       3      924     5.0
268       3      953     5.0
271       3     1060     5.0
272       3     1073     5.0
275       3     1084     5.0
276       3     1089     5.0

In [106]:
is_action= movies['genres'].str.contains('Action')
movies[is_action][5:15]

,movieId,title,genres
22,23,Assassins (1995),Action|Crime|Thriller
41,42,Dead Presidents (1995),Action|Crime|Drama
43,44,Mortal Kombat (1995),Action|Adventure|Fantasy
50,51,Guardian Angel (1994),Action|Drama|Thriller
65,66,Lawnmower Man 2: Beyond Cyberspace (1996),Action|Sci-Fi|Thriller
69,70,From Dusk Till Dawn (1996),Action|Comedy|Horror|Thriller
70,71,Fair Game (1995),Action
75,76,Screamers (1995),Action|Sci-Fi|Thriller
77,78,"Crossing Guard, The (1995)",Action|Crime|Drama|Thriller
85,86,White Squall (1996),Action|Adventure|Drama

In [107]:
movies[is_action].head(15)

,movieId,title,genres
5,6,Heat (1995),Action|Crime|Thriller
8,9,Sudden Death (1995),Action
9,10,GoldenEye (1995),Action|Adventure|Thriller
14,15,Cutthroat Island (1995),Action|Adventure|Romance
19,20,Money Train (1995),Action|Comedy|Crime|Drama|Thriller
22,23,Assassins (1995),Action|Crime|Thriller
41,42,Dead Presidents (1995),Action|Crime|Drama
43,44,Mortal Kombat (1995),Action|Adventure|Fantasy
50,51,Guardian Angel (1994),Action|Drama|Thriller
65,66,Lawnmower Man 2: Beyond Cyberspace (1996),Action|Sci-Fi|Thriller
69,70,From Dusk Till Dawn (1996),Action|Comedy|Horror|Thriller
70,71,Fair Game (1995),Action
75,76,Screamers (1995),Action|Sci-Fi|Thriller
77,78,"Crossing Guard, The (1995)",Action|Crime|Drama|Thriller
85,86,White Squall (1996),Action|Adventure|Drama

## ðŸ‘¥ Group By and Aggregate

In [108]:
ratings_count = ratings[['movieId','rating']].groupby('rating').count()
ratings_count

        movieId
rating
0.5      239125
1.0      680732
1.5      279252
2.0     1430997
2.5      883398
3.0     4291193
3.5     2200156
4.0     5561926
4.5     1534824
5.0     2898660

In [109]:
average_rating = ratings[['movieId','rating']].groupby('movieId').mean()
average_rating.head()

           rating
movieId
1        3.921240
2        3.211977
3        3.151040
4        2.861393
5        3.064592

In [110]:
movie_count = ratings[['movieId','rating']].groupby('movieId').count()
movie_count.head()

         rating
movieId
1         49695
2         22243
3         12735
4          2756
5         12161

In [111]:
movie_count = ratings[['movieId','rating']].groupby('movieId').count()
movie_count.tail()

         rating
movieId
131254        1
131256        1
131258        1
131260        1
131262        1

## ðŸ”° Merge Dataframes

In [112]:
tags.head()

   userId  movieId            tag
0      18     4141    Mark Waters
1      65      208      dark hero
2      65      353      dark hero
3      65      521  noir thriller
4      65      592      dark hero

In [113]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [114]:
t = movies.merge(tags, on='movieId', how='inner')
t.head()

,movieId,title,genres,userId,tag
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1644,Watched
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1741,computer animation
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1741,Disney animated feature
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1741,Pixar animation
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1741,TÃƒÂ©a Leoni does not star in this movie

In [115]:
print(movies.shape)
print(tags.shape)
print(t.shape)

(27278, 3)
(465548, 3)
(465548, 5)

In [120]:
t[['movieId','userId']].groupby('movieId').count().shape

(19545, 1)

In [121]:
t[['movieId','userId']].groupby('userId').count().shape

(7801, 1)

## ðŸ“š Combine aggreagation, merging, and filters to get useful analytics

In [123]:
avg_ratings= ratings.groupby('movieId', as_index=False).mean()
avg_ratings

       movieId         userId    rating
0            1   69282.396821  3.921240
1            2   69169.928202  3.211977
2            3   69072.079388  3.151040
3            4   69652.913280  2.861393
4            5   69113.475454  3.064592
...        ...            ...       ...
26739   131254   79570.000000  4.000000
26740   131256   79570.000000  4.000000
26741   131258   28906.000000  2.500000
26742   131260   65409.000000  3.000000
26743   131262  133047.000000  4.000000

[26744 rows x 3 columns]

In [124]:
del avg_ratings['userId']
avg_ratings.head()

   movieId    rating
0        1  3.921240
1        2  3.211977
2        3  3.151040
3        4  2.861393
4        5  3.064592

In [126]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [125]:
box_office = movies.merge(avg_ratings, on='movieId', how='inner')
box_office.tail()

,movieId,title,genres,rating
26739,131254,Kein Bund fÃ¼r's Leben (2007),Comedy,4.0
26740,131256,"Feuer, Eis & Dosenbier (2002)",Comedy,4.0
26741,131258,The Pirates (2014),Adventure,2.5
26742,131260,Rentun Ruusu (2001),(no genres listed),3.0
26743,131262,Innocence (2014),Adventure|Fantasy|Horror,4.0

In [127]:
is_highly_rated = box_office['rating'] >= 4.0
box_office[is_highly_rated][-5:]

,movieId,title,genres,rating
26737,131250,No More School (2000),Comedy,4.0
26738,131252,Forklift Driver Klaus: The First Day on the Jo...,Comedy|Horror,4.0
26739,131254,Kein Bund fÃ¼r's Leben (2007),Comedy,4.0
26740,131256,"Feuer, Eis & Dosenbier (2002)",Comedy,4.0
26743,131262,Innocence (2014),Adventure|Fantasy|Horror,4.0

In [128]:
is_Adventure = box_office['genres'].str.contains('Adventure')
box_office[is_Adventure][:5]

,movieId,title,genres,rating
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,3.921240
1,2,Jumanji (1995),Adventure|Children|Fantasy,3.211977
7,8,Tom and Huck (1995),Adventure|Children,3.142049
9,10,GoldenEye (1995),Action|Adventure|Thriller,3.430029
12,13,Balto (1995),Adventure|Animation|Children,3.272416

In [129]:
box_office[is_Adventure & is_highly_rated][-5:]

,movieId,title,genres,rating
26611,130586,Itinerary of a Spoiled Child (1988),Adventure|Drama,4.5
26655,130996,The Beautiful Story (1992),Adventure|Drama|Fantasy,5.0
26667,131050,Stargate SG-1 Children of the Gods - Final Cut...,Adventure|Sci-Fi|Thriller,5.0
26736,131248,Brother Bear 2 (2006),Adventure|Animation|Children|Comedy|Fantasy,4.0
26743,131262,Innocence (2014),Adventure|Fantasy|Horror,4.0

## ðŸ“ Vectorized String Operations

In [130]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

## ðŸ”¬ Split 'genres' into multiple columns

In [131]:
movie_genres = movies['genres'].str.split('|', expand=True)

In [132]:
movie_genres[:10]

,0,1,2,3,4,5,6,7,8,9
0,Adventure,Animation,Children,Comedy,Fantasy,None,None,None,None,None
1,Adventure,Children,Fantasy,None,None,None,None,None,None,None
2,Comedy,Romance,None,None,None,None,None,None,None,None
3,Comedy,Drama,Romance,None,None,None,None,None,None,None
4,Comedy,None,None,None,None,None,None,None,None,None
5,Action,Crime,Thriller,None,None,None,None,None,None,None
6,Comedy,Romance,None,None,None,None,None,None,None,None
7,Adventure,Children,None,None,None,None,None,None,None,None
8,Action,None,None,None,None,None,None,None,None,None
9,Action,Adventure,Thriller,None,None,None,None,None,None,None

## ðŸš© Add a new column for comedy genre flag

In [133]:
movie_genres['isComedy'] = movies['genres'].str.contains('Comedy')

In [134]:
movie_genres[:10]

,0,1,2,3,4,5,6,7,8,9,isComedy
0,Adventure,Animation,Children,Comedy,Fantasy,None,None,None,None,None,True
1,Adventure,Children,Fantasy,None,None,None,None,None,None,None,False
2,Comedy,Romance,None,None,None,None,None,None,None,None,True
3,Comedy,Drama,Romance,None,None,None,None,None,None,None,True
4,Comedy,None,None,None,None,None,None,None,None,None,True
5,Action,Crime,Thriller,None,None,None,None,None,None,None,False
6,Comedy,Romance,None,None,None,None,None,None,None,None,True
7,Adventure,Children,None,None,None,None,None,None,None,None,False
8,Action,None,None,None,None,None,None,None,None,None,False
9,Action,Adventure,Thriller,None,None,None,None,None,None,None,False

## ðŸ“Ÿ Extract year from title e.g. (2007)

In [138]:
movies['year'] = movies['title'].str.extract(r'.*\((.*)\).*', expand=True)

In [139]:
movies.tail()

       movieId                          title                    genres  year
27273   131254   Kein Bund fÃ¼r's Leben (2007)                    Comedy  2007
27274   131256  Feuer, Eis & Dosenbier (2002)                    Comedy  2002
27275   131258             The Pirates (2014)                 Adventure  2014
27276   131260            Rentun Ruusu (2001)        (no genres listed)  2001
27277   131262               Innocence (2014)  Adventure|Fantasy|Horror  2014

## ðŸ• Parsing Timestamps

In [143]:
tags = pd.read_csv('archive/tag.csv')

In [144]:
tags.dtypes

userId        int64
movieId       int64
tag          object
timestamp    object
dtype: object

Unix time / POSIX time / epoch time records time in seconds

since midnight Coordinated Universal Time (UTC) of April 4, 2009

In [145]:
tags.head(5)

   userId  movieId            tag            timestamp
0      18     4141    Mark Waters  2009-04-24 18:19:40
1      65      208      dark hero  2013-05-10 01:41:18
2      65      353      dark hero  2013-05-10 01:41:19
3      65      521  noir thriller  2013-05-10 01:39:43
4      65      592      dark hero  2013-05-10 01:41:18

In [148]:
tags['timestamp'].dtype

dtype('O')

In [150]:
# Selecting rows based on timestamps

greater_than_t = tags['timestamp'] > '2015-02-01'

selected_rows = tags[greater_than_t]

tags.shape, selected_rows.shape

((465564, 4), (12130, 4))

In [151]:
#Sorting the table using the timestamps

tags.sort_values(by='timestamp', ascending=True)[:10]

        userId  movieId              tag            timestamp
333932  100371     2788     monty python  2005-12-24 13:00:10
333927  100371     1732    coen brothers  2005-12-24 13:00:36
333924  100371     1206  stanley kubrick  2005-12-24 13:00:48
333923  100371     1193   jack nicholson  2005-12-24 13:02:51
333939  100371     5004    peter sellers  2005-12-24 13:03:19
333922  100371       47   morgan freeman  2005-12-24 13:03:32
333921  100371       47        brad pitt  2005-12-24 13:03:32
333936  100371     4011        brad pitt  2005-12-24 13:03:51
333937  100371     4011      guy ritchie  2005-12-24 13:03:51
333920  100371       32     bruce willis  2005-12-24 13:04:02

## ðŸ“‡ Average Movie Ratings over Time

In [152]:
# Movie ratings related to the year of launch?

average_rating = ratings[['movieId','rating']].groupby('movieId', as_index=False).mean()
average_rating.tail()

       movieId  rating
26739   131254     4.0
26740   131256     4.0
26741   131258     2.5
26742   131260     3.0
26743   131262     4.0

In [157]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27278 entries, 0 to 27277
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  27278 non-null  int64
 1   title    27278 non-null  object
 2   genres   27278 non-null  object
 3   year     27261 non-null  object
dtypes: int64(1), object(3)
memory usage: 852.6+ KB

In [158]:
joined = movies.merge(average_rating, on='movieId', how='inner')
joined.head()
#joined.corr()

,movieId,title,genres,year,rating
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1995,3.921240
1,2,Jumanji (1995),Adventure|Children|Fantasy,1995,3.211977
2,3,Grumpier Old Men (1995),Comedy|Romance,1995,3.151040
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance,1995,2.861393
4,5,Father of the Bride Part II (1995),Comedy,1995,3.064592

In [160]:
joined[['movieId','rating']].corr()

          movieId    rating
movieId  1.000000 -0.090369
rating  -0.090369  1.000000